sisext-sapi-services/src/main/resources/soap/schemas/templates/soap-post-verificacionEvidenteLISIM.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:ValidarCuestionario>
         <tem:objSolicitud>
            <tem:Usuario>#[p('temDataServices.credentials.user')]</tem:Usuario>
            <tem:Contrasena>#[p('temDataServices.credentials.password')]</tem:Contrasena>
            <tem:IdCuestionario>#[payload.validateQuestionnaire.objRequest.questionnaireId]</tem:IdCuestionario>
            <tem:Respuestas>#[vars.answers.Respuestas]</tem:Respuestas>
            <tem:Modelo>#[payload.validateQuestionnaire.objRequest.model]</tem:Modelo>
            <tem:Departamento>#[payload.validateQuestionnaire.objRequest.department]</tem:Departamento>
            <tem:Ciudad>#[payload.validateQuestionnaire.objRequest.city]</tem:Ciudad>
            <tem:Asesor>#[payload.validateQuestionnaire.objRequest.adviser]</tem:Asesor>
            <tem:CanalVenta>#[payload.validateQuestionnaire.objRequest.salesChannel]</tem:CanalVenta>
            <tem:Proveedor>#[payload.validateQuestionnaire.objRequest.supplier]</tem:Proveedor>
            <tem:Portal>#[payload.validateQuestionnaire.objRequest.portal]</tem:Portal>
            <tem:NumeroContacto>#[payload.validateQuestionnaire.objRequest.contactNumber]</tem:NumeroContacto>
            <tem:Tipo>#[payload.validateQuestionnaire.objRequest.'type']</tem:Tipo>
            <tem:Estrato>#[payload.validateQuestionnaire.objRequest.stratum]</tem:Estrato>
            <tem:CalcularScore>#[payload.validateQuestionnaire.objRequest.calculateScore]</tem:CalcularScore>
         </tem:objSolicitud>
      </tem:ValidarCuestionario>
   </soapenv:Body>
</soapenv:Envelope>